src/Documents/АнкетаЗастрахованногоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>АнкетаЗастрахованногоЛица</Name>
			<Comment>(Регл)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АрхивДанныхРегламентированнойОтчетности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматФайлаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереключательТипЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресРегистрации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефоны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гражданство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресФактический</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>240</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексРегистрации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГородРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РайонРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбластьРождения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортСерия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортКемВыдан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>56</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПаспортДатавыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛичныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаРождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументВид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойНомерСтарый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияСтарый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСтарый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоСтарый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияСтарый</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ГражданствоФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SurName</Name>
					<Comment>//+ СВЭЙ КДЯ СВФР-004525  15.07.19</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>GivenNames</Name>
					<Comment>//+ СВЭЙ КДЯ СВФР-004525  15.07.19</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/АнкетаЗастрахованногоЛица/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет автоматическое заполнение документа по данным документа и переданным параметрам
// 
// Параметры: 
//  нет
//
// Возвращаемое значение:
//  Логическое - удалось ли выполнить автоматическое заполнение документа
//
Функция Автозаполнение() Экспорт

    СписокПустыхНомеровПФР = Новый СписокЗначений;
	СписокПустыхНомеровПФР.Добавить("");
	СписокПустыхНомеровПФР.Добавить("              ");
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",				ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Организация",				Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("СписокПустыхНомеровПФР",		СписокПустыхНомеровПФР);
	Запрос.УстановитьПараметр("Увольнение",		Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("ДатаАктуальности" , 		Дата);
	Запрос.УстановитьПараметр("ДатаАктуальностиСтарый" , 		НачалоДня(Дата)-1);//О.Т. Аверсон 14.04.2016 № 868
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , 	Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , 	Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
   	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , 	Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);
   	Запрос.УстановитьПараметр("ТипТелефон" , 	Перечисления.ТипыКонтактнойИнформации.Телефон);
   	Запрос.УстановитьПараметр("ТипАдрес" , 	Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ПустаяСтрана" , Справочники.КлассификаторСтранМира.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.БЕЛАРУСЬ);
	Запрос.УстановитьПараметр("ФлагИзменение" , ПереключательТипЗаписи);
	Запрос.УстановитьПараметр("СтранапоУмолчанию" , Справочники.КлассификаторСтранМира.БЕЛАРУСЬ);

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	АдресаРегистрации.Поле1 КАК ИндексРегистрации,
	|	АдресаРегистрации.Поле2 + "","" + АдресаРегистрации.Поле3 + ВЫБОР
	|		КОГДА АдресаРегистрации.Поле3 ЕСТЬ NULL 
	|			ТОГДА "",""
	|		ИНАЧЕ "" р-н ,""
	|	КОНЕЦ + АдресаРегистрации.Поле4 + "","" + АдресаРегистрации.Поле5 + ВЫБОР
	|		КОГДА АдресаРегистрации.Поле5 ЕСТЬ NULL 
	|			ТОГДА "",""
	|		ИНАЧЕ "" с/с ,""
	|	КОНЕЦ + АдресаРегистрации.Поле6 + "","" + АдресаРегистрации.Поле7 + "","" + АдресаРегистрации.Поле8 + "","" + АдресаРегистрации.Поле9 КАК АдресРегистрации,
	|	ДомашниеТелефоны.Поле3 КАК Телефоны,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ЛичныйНомер КАК ЛичныйНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК ПаспортСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК ПаспортНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ПаспортДатаВыдачи,
	//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
	//|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ПаспортКемВыдан,
	//- СВЭЙ КДЯ 01.04.20 СВФР-005753
	//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан1 КАК ПаспортКемВыдан,
	//- СВЭЙ КДЯ 01.04.20 СВФР-005753
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ДокументВид,
	|	СписокФизлиц.ФизЛицо,
	|	СписокФизлиц.ФизЛицо.Пол КАК Пол,
	|	СписокФизлиц.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	СписокФизлиц.ФизЛицо.МестоРождения КАК МестоРождения,
	|	ВЫБОР
	|		КОГДА ГражданствоФизЛиц.ФизЛицо ЕСТЬ NULL 
	|				ИЛИ ГражданствоФизЛиц.Страна = &ПустаяСтрана
	|			ТОГДА &СтранаПоУмолчанию
	|		ИНАЧЕ ГражданствоФизЛиц.Страна
	|	КОНЕЦ КАК Гражданство,
	|	СписокФизлиц.ФизЛицо.ДатаРождения КАК ДатаРожденияСтарый,
	|	ФИОФизЛицСрезПоследнихСтарый.Фамилия КАК ФамилияСтарый,
	|	ФИОФизЛицСрезПоследнихСтарый.Имя КАК ИмяСтарый,
	|	ФИОФизЛицСрезПоследнихСтарый.Отчество КАК ОтчествоСтарый,
	|	ПаспортныеДанныеФизЛицСрезПоследнихСтарый.ЛичныйНомер КАК СтраховойНомерСтарый
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СостояниеРаботниковОрганизацииСрезПоследних.Сотрудник.Физлицо КАК ФизЛицо
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаАктуальности,
	|				Организация = &ГоловнаяОрганизация
	|					И НЕ Сотрудник.ФизЛицо В
	|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|								АнкетаЗастрахованногоЛицаРаботникиОрганизации.ФизЛицо
	|							ИЗ
	|								Документ.АнкетаЗастрахованногоЛица.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботникиОрганизации
	|							ГДЕ
	|								АнкетаЗастрахованногоЛицаРаботникиОрганизации.Ссылка <> &Ссылка
	|								И АнкетаЗастрахованногоЛицаРаботникиОрганизации.Ссылка.Проведен)
	|					И Сотрудник.ФизЛицо.СтраховойНомерПФР В (&СписокПустыхНомеровПФР)) КАК СостояниеРаботниковОрганизацииСрезПоследних
	|	ГДЕ
	|		СостояниеРаботниковОрганизацииСрезПоследних.ПричинаИзмененияСостояния <> &Увольнение
	|		И СостояниеРаботниковОрганизацииСрезПоследних.ПодразделениеОрганизации.Владелец = &Организация
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо
	|	ИЗ
	|		Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
	|	ГДЕ
	|		ДоговорНаВыполнениеРаботСФизЛицом.Организация = &Организация
	|		И НЕ ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						АнкетаЗастрахованногоЛицаРаботникиОрганизации.ФизЛицо
	|					ИЗ
	|						Документ.АнкетаЗастрахованногоЛица.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботникиОрганизации
	|					ГДЕ
	|						АнкетаЗастрахованногоЛицаРаботникиОрганизации.Ссылка <> &Ссылка
	|						И АнкетаЗастрахованногоЛицаРаботникиОрганизации.Ссылка.Проведен)
	|		И ДоговорНаВыполнениеРаботСФизЛицом.ФизЛицо.СтраховойНомерПФР В(&СписокПустыхНомеровПФР)
	|		И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
	|		И ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
	|		И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаАктуальности) КАК СписокФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ГражданствоФизЛиц
	|		ПО СписокФизлиц.ФизЛицо = ГражданствоФизЛиц.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СписокФизлиц.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальности, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СписокФизлиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ДомашниеТелефоны
	|		ПО СписокФизлиц.ФизЛицо = ДомашниеТелефоны.Объект
	|			И (ДомашниеТелефоны.Вид = &ВидТелефонаДомашний)
	|			И (ДомашниеТелефоны.Тип = &ТипТелефон)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаФактические
	|		ПО СписокФизлиц.ФизЛицо = АдресаФактические.Объект
	|			И (АдресаФактические.Вид = &ВидАдресаФактический)
	|			И (АдресаФактические.Тип = &ТипАдрес)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаРегистрации
	|		ПО СписокФизлиц.ФизЛицо = АдресаРегистрации.Объект
	|			И (АдресаРегистрации.Вид = &ВидАдресаРегистрации)
	//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
	//|			И (АдресаФактические.Тип = &ТипАдрес)
	//- СВЭЙ КДЯ 01.04.20 СВФР-005753
	//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
	|			И (АдресаРегистрации.Тип = &ТипАдрес)
	//- СВЭЙ КДЯ 01.04.20 СВФР-005753
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальностиСтарый, ) КАК ФИОФизЛицСрезПоследнихСтарый
	|		ПО СписокФизлиц.ФизЛицо = ФИОФизЛицСрезПоследнихСтарый.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(&ДатаАктуальностиСтарый, ) КАК ПаспортныеДанныеФизЛицСрезПоследнихСтарый
	|		ПО СписокФизлиц.ФизЛицо = ПаспортныеДанныеФизЛицСрезПоследнихСтарый.ФизЛицо
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ФлагИзменение = 2
	|					ИЛИ &ФлагИзменение = 3
	|				ТОГДА ВЫБОР
	|						КОГДА ФИОФизЛицСрезПоследнихСтарый.Фамилия <> ФИОФизЛицСрезПоследних.Фамилия
	|								ИЛИ ФИОФизЛицСрезПоследних.Имя <> ФИОФизЛицСрезПоследнихСтарый.Имя
	|								ИЛИ ФИОФизЛицСрезПоследних.Отчество <> ФИОФизЛицСрезПоследнихСтарый.Отчество
	|								ИЛИ ПаспортныеДанныеФизЛицСрезПоследнихСтарый.ЛичныйНомер <> ПаспортныеДанныеФизЛицСрезПоследних.ЛичныйНомер
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";

	РаботникиОрганизации.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для каждого СтрокаТЧ из РаботникиОрганизации цикл
		СтруктураАдреса = РегламентированнаяОтчетность.РазложитьМестоРождения(СтрокаТЧ.МестоРождения, Истина);
		СтрокаТЧ.ГородРождения = СтруктураАдреса.НаселенныйПункт;
		СтрокаТЧ.РайонРождения = СтруктураАдреса.Район;
		СтрокаТЧ.ОбластьРождения = СтруктураАдреса.Область;
		СтрокаТЧ.СтранаРождения  = ?(Не ЗначениеЗаполнено(СтруктураАдреса.Страна), Справочники.КлассификаторСтранМира.БЕЛАРУСЬ,Справочники.КлассификаторСтранМира.НайтиПоНаименованию(СтруктураАдреса.Страна));
	Конеццикла;

КонецФункции


//Функция раскладывает строку с данными об адресе (в формате 9 запятых) на элементы структуры
Функция РазложитьСтрокуАдрес(Знач СтрокаАдрес) Экспорт
	
	Страна = "";
	Индекс = "";
	Регион = "";
	Район = "";
	Город = "";
	НаселенныйПункт = "";
	Улица ="";
	Дом ="";
	Корпус ="";
	Квартира ="";

	МассивАдрес	=	ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаАдрес);
	ЭлементовВМассиве = МассивАдрес.Количество();   

	Если ЭлементовВМассиве	>	0	тогда
		Страна	=	СокрЛП(МассивАдрес[0]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	1	тогда
		Индекс	=	СокрЛП(МассивАдрес[1]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	2	тогда
		Регион	=	СокрЛП(МассивАдрес[2]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	3	тогда
		Район	=	СокрЛП(МассивАдрес[3]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	4	тогда
		Город	=	СокрЛП(МассивАдрес[4]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	5	тогда
		НаселенныйПункт	=	СокрЛП(МассивАдрес[5]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	6	тогда
		Улица	=	СокрЛП(МассивАдрес[6]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	7	тогда
		Дом	=	СокрЛП(МассивАдрес[7]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	8	тогда
		Корпус	=	СокрЛП(МассивАдрес[8]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	9	тогда
		Квартира	=	СокрЛП(МассивАдрес[9]);
	КонецЕсли;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Страна",Страна);
	СтруктураВозврата.Вставить("Индекс",Индекс);
	СтруктураВозврата.Вставить("Регион",Регион);
	СтруктураВозврата.Вставить("Район",Район);
	СтруктураВозврата.Вставить("Город",Город);
	СтруктураВозврата.Вставить("НаселенныйПункт",НаселенныйПункт);
	СтруктураВозврата.Вставить("Улица",Улица);
	СтруктураВозврата.Вставить("Дом",Дом);
	СтруктураВозврата.Вставить("Корпус",Корпус);
	СтруктураВозврата.Вставить("Квартира",Квартира);

	Возврат СтруктураВозврата;
	
КонецФункции	 

// Процедура заполняет поля объекта редактирования адреса по структуре
Процедура ЗаполнитьРедактированияАдресаПоСтруктуре(Объект, СтруктураАдреса) Экспорт
	
	Если СтруктураАдреса = Неопределено Тогда
		
		Объект.Поле1 = "";
		Объект.Поле2 = "";
		Объект.Поле3 = "";
		Объект.Поле4 = "";
		Объект.Поле5 = "";
		Объект.Поле6 = "";
		Объект.Поле7 = "";
		Объект.Поле8 = "";
		Объект.Поле9 = "";
		Объект.Поле10 = "";
		Объект.Поле11 = "";
		Объект.Поле12 = "";
		Объект.Поле13 = "";
		Объект.Представление = "";
	
		Возврат;
	КонецЕсли;
	
	Если СтруктураАдреса.Свойство("ЗаПределамиРФ") Тогда			
		Объект.Поле1 = СтруктураАдреса.Страна;
		Объект.Представление = СтруктураАдреса.Представление;		
	Иначе
		Объект.Поле1 = СтруктураАдреса.Индекс;
		Объект.Поле2 = СтруктураАдреса.Регион;
		Объект.Поле3 = СтруктураАдреса.Район;
		Объект.Поле4 = СтруктураАдреса.Город;
		Объект.Поле5 = СтруктураАдреса.НаселенныйПункт;
		Объект.Поле6 = СтруктураАдреса.Улица;
		Объект.Поле7 = СтруктураАдреса.Дом;
		Объект.Поле8 = СтруктураАдреса.Корпус;
		Объект.Поле9 = СтруктураАдреса.Квартира;
		//Объект.Поле10 = СтруктураАдреса.Улица;
		//Объект.Поле11 = СтруктураАдреса.Дом;
		//Объект.Поле12 = СтруктураАдреса.Корпус;
		//Объект.Поле13 = СтруктураАдреса.Квартира;
		
		//Определяем представление сразу же
		Объект.Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Объект);
	КонецЕсли;
  
КонецПроцедуры

// Функция возвращает строковое представление адреса (в формате через запятую) , включая незаполненные поля
Функция ПолучитьАдрес(Запись) Экспорт
	
	Результат = "";
	
	Если Запись = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(Запись) = Запись.Представление Тогда	
		Результат = 
		СокрЛП(Запись.Поле2) + ", " +
		СокрЛП(Запись.Поле3) + ", " +
		СокрЛП(Запись.Поле4) + ", " +
		СокрЛП(Запись.Поле5) + ", " +
		СокрЛП(Запись.Поле6) + ", " +
		СокрЛП(Запись.Поле7) + ", " +
		СокрЛП(Запись.Поле8) + ", " +
		СокрЛП(Запись.Поле9);
		
	Иначе
		Результат = Запись.Представление;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрЗаменить(Результат, ",", "")) Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции



#Если Клиент Тогда

// Формирует файл, который можно будет записать на дискетку
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Строка - содержимое файла
//
Функция СформироватьВыходнойФайл(Отказ) Экспорт

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

    ВыборкаПоШапкеДокумента = СформироватьЗапросПоШапке().Выбрать();
	Если ВыборкаПоШапкеДокумента.Следующий()=0 тогда
		Отказ = Истина;
		Возврат "";
	КонецЕсли;	

    ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
	Если Отказ тогда
		Возврат "";
	КонецЕсли;	 

	Результат					=	СформироватьЗапросПоРаботникиОрганизации();
	ВыборкаПоРаботникиОрганизации			=	Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);

	Если ВыборкаПоРаботникиОрганизации.Количество()>200 тогда
		ОбщегоНазначения.СообщитьОбОшибке("В документе должно быть не более 200 анкет (работников)!", Отказ, Заголовок);
	КонецЕсли;	 

	СписокОбработанныхАнкет = Новый СписокЗначений;
	
	ТекстФайла	=	"";
	НомерДокументаВПачке = 0;

	//Формируем заголовок выходного файла
	ДатаФормирования = ВыборкаПоШапкеДокумента.Дата;
	ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
	МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
	ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
	ДатаЗаполнения   = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
	НомерПачки 				= ПроцедурыПерсонифицированогоУчета.НомерПачкиДокумента(ВыборкаПоШапкеДокумента.Номер);
	КоличествоДокументов 	= ВыборкаПоРаботникиОрганизации.Количество();

	Если Отказ тогда
		Возврат "";
	КонецЕсли;	 
	
	ТекстФайла = Новый ТекстовыйДокумент;
	текстФайла.ДобавитьСтроку("ЗГЛВ=1.7="); //Островская Татьяна 17.01.2013 № 16153
	ТекстФайла.ДобавитьСтроку(Врег("<ПАЧК="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.ИНН)+"="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)+
				"="+СокрЛП(ВыборкаПоШапкедокумента.организация.НаименованиеПолное)+"="+Прав(ВыборкаПоШапкеДокумента.Номер,5)+"= = =1="));
	ТекстФайла.ДобавитьСтроку("ТИПД=ПУ-1="+СокрЛП(Строка(КоличествоДокументов))+"= = = = =>");//Островская Татьяна 17.01.2013 № 16153
	//О.Т. Аверсон 14.04.2016 № 868
	Если ПереключательТипЗаписи = 1 Тогда 
		ТипЗаписиБуква = "Р";
	ИначеЕсли ПереключательТипЗаписи = 2 Тогда 
		ТипЗаписиБуква = "И";
	ИначеЕсли ПереключательТипЗаписи = 3 Тогда 
		ТипЗаписиБуква = "В";
	КонецЕсли;
	//О.Т. Аверсон 14.04.2016 № 868
		
	ТипЗаписи = "<ПУ-1="+ТипЗаписиБуква+"="+СокрЛП(ВыборкаПоШапкеДокумента.Организация.РегистрационныйНомерПФР)+"=";
	
	Пока ВыборкаПоРаботникиОрганизации.Следующий()	Цикл
		//Контроль дубля строк
		Если СписокОбработанныхАнкет.НайтиПоЗначению(ВыборкаПоРаботникиОрганизации.ФизЛицо) = Неопределено тогда
			СписокОбработанныхАнкет.Добавить(ВыборкаПоРаботникиОрганизации.ФизЛицо);
		Иначе	
			ОбщегоНазначения.СообщитьОбОшибке("Строка №"+ВыборкаПоРаботникиОрганизации.НомерСтроки+": Работник "+ВыборкаПоРаботникиОрганизации.ФизЛицо+ " указан(а) в документе дважды!", Отказ);
		КонецЕсли;	 
		
        СтрокаФайла = ТипЗаписи;
		//Инициалы должны быть указаны
		Фамилия = ?(ВыборкаПоРаботникиОрганизации.Фамилия = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Фамилия));
		Имя = ?(ВыборкаПоРаботникиОрганизации.Имя = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Имя));
		Отчество = ?(ВыборкаПоРаботникиОрганизации.Отчество = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.Отчество));
		//+ СВЭЙ КДЯ 01.10.19 СВФР-004854
		Фамилия = ВРег( Фамилия );
		Имя = ВРег( Имя );
		Отчество = ВРег( Отчество );
		//- СВЭЙ КДЯ 01.10.19 СВФР-004854
		СтрокаФайла = СтрокаФайла+Фамилия+"="+Имя+"="+Отчество+"=";
		


		Если Отказ Тогда
			Продолжить;
		КонецЕсли;

		НомерДокументаВПачке = 	НомерДокументаВПачке + 1;

		//Берем запись с пустыми полями
		//Запись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);

		НомерДокументаВПачке = НомерДокументаВПачке;
		ДатаЗаполнения = ДатаЗаполнения;
		
		Пол = ?( ПереключательТипЗаписи = 3
		            //+ СВЭЙ КДЯ 15.06.19 СВФР-004382
					ИЛИ ПереключательТипЗаписи = 2 И НЕ ЗначениеЗаполнено( ВыборкаПоРаботникиОрганизации.Пол )
		            //- СВЭЙ КДЯ 15.06.19 СВФР-004382
					, " ", //СВЭЙ КДЯ 21.05.19 СВФР-004361
					?(ВыборкаПоРаботникиОрганизации.Пол = Перечисления.ПолФизическихЛиц.Мужской, "М", "Ж")
				); //СВЭЙ КДЯ 21.05.19 СВФР-004361
		
		ДатаФормирования = ВыборкаПоРаботникиОрганизации.ДатаРождения;
		Если Не ЗначениеЗаполнено(ДатаФормирования) тогда
			ДеньШапки = " ";
			МесяцШапки = "";
			ГодШапки = "";
		СтДатаРождения = ДеньШапки;
		Иначе
			ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
			МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
			ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
		СтДатаРождения = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		Конецесли;
		

		Гражданство = СокрЛП(ВыборкаПоРаботникиОрганизации.Страна);
		//+ СВЭЙ КДЯ 21.05.19 СВФР-004361
		Гражданство = ?( Гражданство = "", " ", Гражданство );
		//- СВЭЙ КДЯ 21.05.19 СВФР-004361
		
		//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
		Если НЕ ЗначениеЗаполнено( Гражданство ) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Для " + Фамилия+" "+Имя+" "+Отчество
			+" не заполнено Гражданство или реквизит ""Код"" в стране Гражданства");
		КонецЕсли; 
		//- СВЭЙ КДЯ 01.04.20 СВФР-005753

		ГородРождения = ?(СокрЛП(ВыборкаПоРаботникиОрганизации.ГородРождения) = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.ГородРождения));
		РайонРождения = ?(СокрЛП(ВыборкаПоРаботникиОрганизации.РайонРождения) = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.РайонРождения));
		ОбластьРождения = ?(СокрЛП(ВыборкаПоРаботникиОрганизации.ОбластьРождения) = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.ОбластьРождения+" ОБЛАСТЬ"));
		
		//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
		//СтранаРождения = ?(Не ЗначениеЗаполнено(ВыборкаПоРаботникиОрганизации.СтранаРождения), " ", ВРег(СокрЛП(ВыборкаПоРаботникиОрганизации.СтранаРождения.НаименованиеПолное)));
		//- СВЭЙ КДЯ 01.04.20 СВФР-005753
		
		//+ СВЭЙ КДЯ 01.04.20 СВФР-005753
		Если ЗначениеЗаполнено( ВыборкаПоРаботникиОрганизации.СтранаРождения ) Тогда
			Если ЗначениеЗаполнено( ВыборкаПоРаботникиОрганизации.СтранаРождения.НаименованиеПолное ) Тогда
				СтранаРождения = ВРег( СокрЛП( ВыборкаПоРаботникиОрганизации.СтранаРождения.НаименованиеПолное ) );
			Иначе
				СтранаРождения = ВРег( СокрЛП( ВыборкаПоРаботникиОрганизации.СтранаРождения.Наименование ) );
			КонецЕсли;
		Иначе	
			СтранаРождения = " ";
		КонецЕсли; 
		//- СВЭЙ КДЯ 01.04.20 СВФР-005753
		
		СтрокаФайла = СтрокаФайла + Пол+"="+Гражданство+"="+СтДатаРождения+"="+городРождения+"="+РайонРождения+"="+ОбластьРождения+"="+СтранаРождения+"=";
		Если ВыборкаПоРаботникиОрганизации.ДокументВид.КодИМНС = "02" тогда	
			СтрокаФайла = СтрокаФайла + СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументСерия)+"=";
			СтрокаФайла = СтрокаФайла + СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументНомер)+"=";
		Иначе
			СтрокаФайла = СтрокаФайла + " =";
			СтрокаФайла = СтрокаФайла + ?(СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументСерия)+СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументНомер)=""," ",
			СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументСерия)+СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументНомер))+"=";
		КонецЕсли;
		ДатаФормирования = ВыборкаПоРаботникиОрганизации.ДокументДатаВыдачи;
		
		Если Не ЗначениеЗаполнено(ДатаФормирования) тогда
			ДеньШапки = " ";
			МесяцШапки = "";
			ГодШапки = "";
			СтДатаВыдачи = ДеньШапки;
		Иначе
			ДеньШапки        = ?(День(ДатаФормирования)<10,"0","")+День(ДатаФормирования);
			МесяцШапки       = ?(Месяц(ДатаФормирования)<10,"0","")+Месяц(ДатаФормирования);
			ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормирования), "ЧГ=0")));
			СтДатаВыдачи = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		Конецесли;
		
		ДатаФормированияСтарый = ВыборкаПоРаботникиОрганизации.ДатаРожденияСтарый;
		Если Не ЗначениеЗаполнено(ДатаФормированияСтарый) тогда
			ДеньШапки = " ";
			МесяцШапки = "";
			ГодШапки = "";
		СтДатаРожденияСтарый = ДеньШапки;
		Иначе
			ДеньШапки        = ?(День(ДатаФормированияСтарый)<10,"0","")+День(ДатаФормированияСтарый);
			МесяцШапки       = ?(Месяц(ДатаФормированияСтарый)<10,"0","")+Месяц(ДатаФормированияСтарый);
			ГодШапки 		 = Строка(СокрЛП(Формат(Год(ДатаФормированияСтарый), "ЧГ=0")));
		СтДатаРожденияСтарый = ДеньШапки+"/"+МесяцШапки+"/"+ГодШапки;
		Конецесли;

		
		СтрокаФайла = Строкафайла + СтДатаВыдачи+"=";
		СтрокаФайла = СтрокаФайла + ?(СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументКемВыдан)=""," ",СокрЛП(ВыборкаПоРаботникиОрганизации.ДокументКемВыдан))+"=";
		СтрокаФайла = СтрокаФайла + ?(ВыборкаПоРаботникиОрганизации.ЛичныйНомер=""," ",ВыборкаПоРаботникиОрганизации.ЛичныйНомер)+"=";
		СтрокаФайла = СтрокаФайла + ?(ВыборкаПоРаботникиОрганизации.ИндексРегистрации=""," ",ВыборкаПоРаботникиОрганизации.ИндексРегистрации)+"=";
		СтрокаФайла = СтрокаФайла + ?(ВыборкаПоРаботникиОрганизации.АдресРегистрации=""," ",ВыборкаПоРаботникиОрганизации.АдресРегистрации)+"= = ="+?(ДатаЗаполнения=""," ",ДатаЗаполнения);
		ЛичныйНомерСтарый = ?(ВыборкаПоРаботникиОрганизации.ЛичныйНомерСтарый = ""," ",ВыборкаПоРаботникиОрганизации.ЛичныйНомерСтарый);
		ФамилияСтарый = ?(ВыборкаПоРаботникиОрганизации.ФамилияСтарый = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.ФамилияСтарый));
		ИмяСтарый = ?(ВыборкаПоРаботникиОрганизации.ИмяСтарый = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.ИмяСтарый));
		ОтчествоСтарый = ?(ВыборкаПоРаботникиОрганизации.ОтчествоСтарый = "", " ", СокрЛП(ВыборкаПоРаботникиОрганизации.ОтчествоСтарый));
		//+ СВЭЙ КДЯ 01.10.19 СВФР-004854
		ФамилияСтарый = ВРег( ФамилияСтарый );
		ИмяСтарый = ВРег( ИмяСтарый );
		ОтчествоСтарый = ВРег( ОтчествоСтарый );
		//- СВЭЙ КДЯ 01.10.19 СВФР-004854

		СтрокаФайла = СтрокаФайла + "="+ЛичныйНомерСтарый+"="+ФамилияСтарый+"="+ИмяСтарый+"="+ОтчествоСтарый+
		"="+СтДатаРожденияСтарый+"=>"; //О.Т. Аверсон 14.04.2016 № 868
		ТекстФайла.ДобавитьСтроку(СтрокаФайла);
	КонецЦикла; 
	
	//О.Т. Аверсон 27.06.2016 № 1278
	ПутьКФайлу = РегистрыСведений.УчетнаяПолитикаПоПерсоналуОрганизаций.Получить(Новый Структура("Организация",Организация)).ПутьДляВыгрузкиПУ12;
	
	//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
	ИмяФайлаПачки = ПроцедурыПерсонифицированогоУчета.ПолучитьИмяФайлаФормыПУ( 1, 
		0, Дата, Организация );
	//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
	
	если ЗначениеЗаполнено(ПутьКФайлу) Тогда 
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
		//ТекстФайла.Записать(ПутьКФайлу+"\"+Номер+".txt",КодировкаТекста.ANSI);
		//Сообщить("Файл сохранен: " + ПутьКФайлу+"\"+Номер+".txt");
		//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
		//+ СВЭЙ КДЯ 21.09.19 СВФР-004805
		ТекстФайла.Записать( ПутьКФайлу + "\" + ИмяФайлаПачки, КодировкаТекста.ANSI );
		Сообщить( "Файл сохранен: " + ПутьКФайлу + "\" + ИмяФайлаПачки );
		//- СВЭЙ КДЯ 21.09.19 СВФР-004805 
	КонецЕсли;
	//О.Т. Аверсон 27.06.2016 № 1278

	Возврат ТекстФайла.ПолучитьТекст();
КонецФункции 


//Процедура вывода файла сведений на печать
Процедура ПечатьФайла(РежимПечати = 0, МестоВызова = "") Экспорт

	ЕстьОшибки = Ложь;
	ТекстФайла = РегламентированнаяОтчетность.ПолучитьТекстФайла(ЭтотОбъект,ЕстьОшибки);
	Если ЕстьОшибки тогда
		Возврат;
	КонецЕсли;	 

	Макет = ПолучитьМакет("ФормаАДВ_1");
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_ФормаАДВ_1";

	//Получаем таблицу формата записи
	ДокументФорматЗаписей = ПолучитьМакет("ФорматЗаписей");
	ТаблицаФорматаЗаписи = ПроцедурыПерсонифицированогоУчета.ПолучитьФорматЗаписи("АНКТ",ДокументФорматЗаписей);

	//Получаем инициализированную структуру, соответствующую формату записи 
	//ПустаяЗапись = ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
	
	//Обработка заголовка файла
	ИнформацияОПачке = Новый Структура;
	Если ПроцедурыПерсонифицированогоУчета.РазобратьЗаголовокФайла(ТекстФайла,ИнформацияОПачке)=0 тогда
		Возврат;
	КонецЕсли;	
	
	//Обработка документов файла
	ОбластьАнкета = Макет.ПолучитьОбласть("Анкета");
    
	Для Н=5 по СтрЧислоСтрок(ТекстФайла) цикл
		//Прочитаем запись из файла
		СтрокаФайла = СтрПолучитьСтроку(ТекстФайла,Н);
		Запись = ПроцедурыПерсонифицированогоУчета.ПолучитьСтруктуруЗаписи(ТаблицаФорматаЗаписи);
		СтрОшибка = "";
		Если НЕ ПроцедурыПерсонифицированогоУчета.РазложитьСтрокуВСтруктуруЗаписи(СтрокаФайла,"АНКТ",ТаблицаФорматаЗаписи,Запись,СтрОшибка) тогда
			Сообщить("Ошибка в строке файла № "+Н+": "+СтрОшибка);
			Возврат;
		КонецЕсли;	

		ОбластьАнкета.Параметры.ДатаЗаполнения					= 	"Дата заполнения "+ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДатаЗаполнения);
		ОбластьАнкета.Параметры.Фамилия 						= Запись.Фамилия; 
		ОбластьАнкета.Параметры.Имя 							= Запись.Имя; 
		ОбластьАнкета.Параметры.Отчество 						= Запись.Отчество; 
		ОбластьАнкета.Параметры.Пол 							= Запись.Пол+"     (м/ж)"; 
		ОбластьАнкета.Параметры.ДатаРождения 					= ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.СтандартнаяДатаРождения); 

		//Место рождения
		ОбластьАнкета.Параметры.МестоРожденияТип 				= 	?(Запись.ТипМестаРождения = "ОСОБОЕ", "особое", "");
		ОбластьАнкета.Параметры.МестоРожденияГород 				= 	Запись.МестоРожденияНаселенныйПункт;
		ОбластьАнкета.Параметры.МестоРожденияРайон 				= 	Запись.МестоРожденияРайон;
		ОбластьАнкета.Параметры.МестоРожденияОбласть			= 	Запись.МестоРожденияОбласть;
		ОбластьАнкета.Параметры.МестоРожденияСтрана			 	= 	Запись.МестоРожденияСтрана;

		ОбластьАнкета.Параметры.Гражданство 					= 	Запись.Гражданство;

		//Паспортные данные
		НаименованиеДокумента 									= 	Запись.ДокументНаименование;
		Серия1 													= 	Запись.ДокументСерияРимскиеЦифры;
		Серия2 													= 	Запись.ДокументСерияРусскиеБуквы;
		
		СерияНомер = Серия1 +?( СокрЛП(НаименованиеДокумента) 	= ВРЕГ("паспорт россии"), " ", ?( СокрЛП(НаименованиеДокумента) = ВРЕГ("паспорт"), "-", "") ) + Серия2 +",  " + Формат(Запись.ДокументНомер,"ЧГ=0");

		ОбластьАнкета.Параметры.НаименованиеДокумента		= 	НаименованиеДокумента;
		ОбластьАнкета.Параметры.СерияНомер			 		= 	СерияНомер;
		ОбластьАнкета.Параметры.ДатаВыдачи 					= 	ПроцедурыПерсонифицированогоУчета.ДатаВОтчет(Запись.ДокументДатаВыдачи);
		ОбластьАнкета.Параметры.КемВыдан 					= 	Запись.ДокументКемВыдан;
		
		//Адреса
		ОбластьАнкета.Параметры.АдресРегистрации 			=	РегламентированнаяОтчетность.ПредставлениеАдреса(Запись.АдресРегистрации,0,"");
		ОбластьАнкета.Параметры.АдресФактический 			= 	РегламентированнаяОтчетность.ПредставлениеАдреса(Запись.АдресФактический,0,"");
		ОбластьАнкета.Параметры.Телефоны 					= 	Запись.Телефоны;
		
		ДокументРезультат.Вывести(ОбластьАнкета);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;	
	
	РаботаСДиалогами.НапечататьДокумент(ДокументРезультат,1,Ложь,"Анкета застрахованного лица АДВ-1");

    //Печать описи документов
	ДокументОписи = Новый ТабличныйДокумент;
	ДокументОписи.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АнкетаЗастрахованногоЛица_АДВ_6";
	ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация,Дата,Ответственный.ФизЛицо);
	ПроцедурыПерсонифицированогоУчета.ВывестиОписьАДВ6(ДокументОписи,ИнформацияОПачке,ОтветственныеЛица);
	РаботаСДиалогами.НапечататьДокумент(ДокументОписи,1,Ложь,"Опись документов АДВ-6");
КонецПроцедуры

#КонецЕсли

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Номер, 
	|	Организация,
	|	Ответственный,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Выбирает данные, необходимые для заполнения утвержденных форм как из спр-ка
//  физлиц, так и из соотв. регистров сведений
//
// Параметры: 
//  Нет
//
// Возвращаемое значение:
//  Результат запроса к данным работников документа.
//
Функция	СформироватьЗапросПоРаботникиОрганизации()
	
	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	Запрос.УстановитьПараметр("ДатаАктуальности" , Дата);
	Запрос.УстановитьПараметр("ВидАдресаРегистрации" , Справочники.ВидыКонтактнойИнформации.ЮрАдресФизЛица);
	Запрос.УстановитьПараметр("ВидАдресаФактический" , Справочники.ВидыКонтактнойИнформации.ФактАдресФизЛица);
   	Запрос.УстановитьПараметр("ВидТелефонаДомашний" , Справочники.ВидыКонтактнойИнформации.ТелефонФизЛица);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АнкетаЗастрахованногоЛицаРаботники.НомерСтроки КАК НомерСтроки,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо КАК ФизЛицо,
	|	АнкетаЗастрахованногоЛицаРаботники.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ЛичныйНомер
	|	КОНЕЦ КАК ЛичныйНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортСерия
	|	КОНЕЦ КАК ДокументСерия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортНомер
	|	КОНЕЦ КАК ДокументНомер,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортДатавыдачи
	|	КОНЕЦ КАК ДокументДатаВыдачи,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ПаспортКемВыдан
	|	КОНЕЦ КАК ДокументКемВыдан,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ДокументВид ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ДокументВид
	|	КОНЕЦ КАК ДокументВид,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.АдресРегистрации
	|	КОНЕЦ КАК АдресРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ИндексРегистрации
	|	КОНЕЦ КАК ИндексРегистрации,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Телефоны ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Телефоны
	|	КОНЕЦ КАК Телефоны,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Фамилия ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Фамилия
	|	КОНЕЦ КАК Фамилия,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Имя ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Имя
	|	КОНЕЦ КАК Имя,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.Отчество ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.Отчество
	|	КОНЕЦ КАК Отчество,
	|	АнкетаЗастрахованногоЛицаРаботники.Пол,
	|	АнкетаЗастрахованногоЛицаРаботники.ДатаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ГородРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ГородРождения
	|	КОНЕЦ КАК ГородРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.Гражданство.Код КАК Страна,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.РайонРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.РайонРождения
	|	КОНЕЦ КАК РайонРождения,
	|	АнкетаЗастрахованногоЛицаРаботники.СтранаРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ОбластьРождения
	|	КОНЕЦ КАК ОбластьРождения,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.СтраховойНомерСтарый ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.СтраховойНомерСтарый
	|	КОНЕЦ КАК ЛичныйНомерСтарый,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ФамилияСтарый ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ФамилияСтарый
	|	КОНЕЦ КАК ФамилияСтарый,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ИмяСтарый ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ИмяСтарый
	|	КОНЕЦ КАК ИмяСтарый,
	|	ВЫБОР
	|		КОГДА АнкетаЗастрахованногоЛицаРаботники.ОтчествоСтарый ЕСТЬ NULL 
	|			ТОГДА "" ""
	|		ИНАЧЕ АнкетаЗастрахованногоЛицаРаботники.ОтчествоСтарый
	|	КОНЕЦ КАК ОтчествоСтарый,
	|	АнкетаЗастрахованногоЛицаРаботники.ДатаРожденияСтарый
	|ИЗ
	|	Документ.АнкетаЗастрахованногоЛица.РаботникиОрганизации КАК АнкетаЗастрахованногоЛицаРаботники
	|ГДЕ
	|	АнкетаЗастрахованногоЛицаРаботники.Ссылка = &ДокументСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции



// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, которая подает сведения!", Отказ, Заголовок);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Ответственный) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано ответственное лицо!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса по работникам, 
//  Отказ 						- флаг отказа в проведении.
//	Заголовок				- Заголовок для сообщений об ошибках проведения
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Фамилия, Имя, Отказ ,Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке № """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части ""Работники организации"": ";
	// ФизЛицо
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ФизЛицо) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не выбран работник!", Отказ ,Заголовок);
	Иначе	
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + ВыборкаПоСтрокамДокумента.ФизЛицо + " ";

		Если  ЗначениеЗаполнено(СтрЗаменить(ВыборкаПоСтрокамДокумента.СтраховойНомерПФР,"-","")) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Уже имеет страховой номер!", Отказ ,Заголовок);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Фамилия) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана фамилия!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(Имя) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задано имя!", Отказ ,Заголовок);
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Пол) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан пол!", Отказ ,Заголовок);
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаРождения) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата рождения!", Отказ ,Заголовок);
		Иначе
			Если ВыборкаПоСтрокамДокумента.ДатаРождения > Дата тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не может быть больше даты подачи сведений!", Отказ ,Заголовок);
			КонецЕсли;	 
		КонецЕсли;	
		
		Если СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "" 
			или СокрЛП(СтрЗаменить(ВыборкаПоСтрокамДокумента.МестоРождения,",","")) = "0" Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указано место рождения!", Отказ ,Заголовок);
		КонецЕсли; 

		//Паспортные данные
        Если ВыборкаПоСтрокамДокумента.ДокументВид = NULL Тогда

			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не указаны паспортные данные!", Отказ ,Заголовок);

		Иначе

			//Проверка реквизитов паспортных данных
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументВид) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан вид документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;	

			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана дата выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
			Иначе
				Если (ВыборкаПоСтрокамДокумента.ДатаРождения > ВыборкаПоСтрокамДокумента.ДокументДатаВыдачи) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Дата рождения не должна превышать дату выдачи документа, удостоверяющего личность!", Отказ ,Заголовок);
				КонецЕсли;
			КонецЕсли;	

			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументСерия) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задана серия документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДокументНомер) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан номер документа, удостоверяющего личность!", Отказ ,Заголовок);
			КонецЕсли;
		КонецЕсли; 

		// Проверка адреса регистрации и проживания
		Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.АдресРегистрации) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- Не задан адрес регистрации (юридический адрес)!", Отказ ,Заголовок);
		КонецЕсли;	
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(РегламентированнаяОтчетность.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресРегистрации)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В адресе регистрации присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;
		Если НЕ РегламентированнаяОтчетность.АдресСоответствуетТребованиям(РегламентированнаяОтчетность.РазложитьАдрес(ВыборкаПоСтрокамДокумента.АдресФактический)) тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "- В фактическом адресе проживания присутствуют латинские или недопустимые символы!", Отказ ,Заголовок);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	//При проведении файл формируем заново 
	ТекстФайла = "";
	#Если Клиент Тогда
	ТекстФайла = СформироватьВыходнойФайл(Отказ);
	#КонецЕсли
	Если Отказ тогда
		Возврат;
	КонецЕсли;	 

	//Сохраним сформированный файл сведений в регистре сведений
	Запись = Движения["АрхивДанныхРегламентированнойОтчетности"].Добавить();
	Запись.Объект = Ссылка;
	Запись.ОписаниеДанных = "Файл-пачка форм ПУ-1";
	Запись.Данные = ТекстФайла; 
КонецПроцедуры	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации,,"ФизЛицо");
	
КонецПроцедуры
